<html>
    <head>
        
        <title>
                Dev System | Home
        </title>
        <link rel="stylesheet" href="css.css"class="alignright" alt=""/>
        <meta name="viewport" content="width=device-width, initial-scale=1">
    </head>
    <body>
      <CENTER><nav>
          <img src="logo.gif"height=200 width="200" >
            <ul class="container">
              <li class='dropdown'>
                <a href='Objetivo.html'>
                  <i class="fa fa-bullseye">
                </i>
                Objetivo
                </a>
                
                    </div>
                    
                 
                  
                    
                  </div>
                </div>
              </li>
              <li><a href='Sobre Mim.html'>
                Sobre Mim
              </a>
            </li>
              <a href='Contatos.html'
              ><li>
                Contatos</a></li>
              <li></li>
              <li></li>
              <li></li>
              <li></li>
              <li></li>
              
              <li><div class="search-box" div style='text-align:right'">
                <input type="text" class="search-txt" placeholder="Pesquisar">
                <a href="#" class="search-bnt">
                  <img src="L.png" alt="Lupa" height="20" width="20">
                </a>
             
              </div>
            </li>
            </ul><!-- .container -->
          </nav>
        </CENTER>
        <br>
        <br>
      
        <center>
          
          
          <div id="container">
          <font face="Courier New">
        <br>
        <center><h1 style="line-height: 1.2; font-size: 27px;">O que um Programador J&uacute;nior deve saber?</h1></center><br><br>
<p><CENTER><img src="texto.png"height=600 width="1000" ></CENTER></p>
<br><br><br>
<div id="separação"><font face='Verdana'>
<h1>Os juniores devem entender os conceitos fundamentais de programa&ccedil;&atilde;o</h1><br><br></font>


<br>Ter uma boa l&oacute;gica de programa&ccedil;&atilde;o &eacute; essencial para os desenvolvedores juniores. Todos os dias surgem problemas que devem ser resolvidos o mais
r&aacute;pido poss&iacute;vel, exigindo agilidade e racioc&iacute;nio l&oacute;gico dos profissionais. Possuir essa habilidade &eacute; vital para sua carreira. Se voc&ecirc;
deseja desenvolver e praticar essa habilidade, existem v&aacute;rios sites e ferramentas na Internet, uma delas &eacute; o CodeWars.<br>

<br>Sabemos que &eacute; muito importante para um iniciante entender as etapas de trabalho de um trecho de c&oacute;digo. Mas apenas entender as etapas &eacute; in&uacute;til
se voc&ecirc; realmente n&atilde;o souber como esse c&oacute;digo &eacute; executado. &Eacute; muito comum na programa&ccedil;&atilde;o utilizar estruturas de controle
e repeti&ccedil;&atilde;o para executar diferentes a&ccedil;&otilde;es dependendo da a&ccedil;&atilde;o escolhida pelo usu&aacute;rio. Por exemplo, digamos que voc&ecirc;
s&oacute; queira redirecionar os usu&aacute;rios para sua p&aacute;gina de perfil depois que eles fizerem login. Para isso, &eacute; necess&aacute;rio criar uma estrutura
que verifique se a condi&ccedil;&atilde;o para o usu&aacute;rio estar logado &eacute; verdadeira. Desta forma, podemos criar uma melhor experi&ecirc;ncia e controlar determinadas &aacute;reas do nosso site.
Programadores j&uacute;nior completos precisam dominar os recursos b&aacute;sicos da linguagem. Voc&ecirc; precisa saber lidar bem com o gerenciador de pacotes sem atrapalhar o projeto.
Se ele usa apenas um idioma, se n&atilde;o o domina totalmente, n&atilde;o resta muito .
</div>
<br>
<br>
<br>

<div id="separação2">
  <font face='Verdana'>
    <b>

    </b>
    <h1>Os juniores devem se sentir confort&aacute;veis ​​com as ferramentas b&aacute;sicas de desenvolvimento de software</h1></b><br><br></font>


No geral, o que eu espero que um desenvolvedor J&uacute;nior saiba &eacute; criar um CRUD b&aacute;sico, seja ele no Frontend ou no Backend.Usando a sem&acirc;ntica correta do HTML,
com um m&iacute;nimo de responsividade, usando os verbos HTTP corretos e persistindo os dados em um banco de dados.Como voc&ecirc; j&aacute; deve ter percebido, este pequeno guia &eacute; apenas um breve apanhado de como funcionam os processos seletivos para empregos de desenvolvimento de software
que envolvem programa&ccedil;&atilde;o. O objetivo &eacute; torn&aacute;-lo familiar a voc&ecirc;, desmistific&aacute;-lo, pois quando entendemos como algo funciona &eacute; mais f&aacute;cil perder o medo.
O Junior completo n&atilde;o depende de curso online, porque sabe ler documenta&ccedil;&atilde;o, sabe ler exemplos de c&oacute;digo e se houver um livro relevante ele poder&aacute;
ler tamb&eacute;m. Como se comunica bem com os mais experientes, ele escuta o que &eacute; bom aprender e vai l&aacute; estudar, assim ele fica cada vez melhor tamb&eacute;m no time.
<br><br></div>

<div id="separação2"><font face='Verdana'><b><h1>Os programadores juniores devem manter uma atitude positiva e estar abertos a feedback</h1></b><br><br></font>


Como farejar o desenvolvedor j&uacute;nior? Os desenvolvedores juniores s&atilde;o inexperientes no uso das ferramentas, alguns acabaram de se formar
e est&atilde;o come&ccedil;ando seu primeiro emprego de tempo integral. A mentalidade geralmente &eacute; apenas fazer o c&oacute;digo funcionar,
como eles ainda n&atilde;o possuem a bagagem n&atilde;o se preocupam com o impacto que uma altera&ccedil;&atilde;o pode causar em termos de desempenho,
ou mesmo de seguran&ccedil;a ou escalabilidade. Software funcional e bom software s&atilde;o considerados a mesma coisa, ou seja, se funciona t&aacute; bom.

<br>

Por fim, a pessoa desenvolvedora j&uacute;nior tamb&eacute;m poder&aacute; ter alguma ou nenhuma experi&ecirc;ncia. Assim como os cargos anteriores, se trata de
uma posi&ccedil;&atilde;o que objetiva a aquisi&ccedil;&atilde;o de conhecimento pr&aacute;tico, por&eacute;m n&atilde;o &eacute; obrigat&oacute;rio possuir diploma
de algum curso t&eacute;cnico ou superior. A posi&ccedil;&atilde;o nessa fun&ccedil;&atilde;o varia de 3 a 5 anos.

<br>

Al&eacute;m das habilidades de codifica&ccedil;&atilde;o, existem alguns outros fatores que podem determinar o n&iacute;vel do desenvolvedor, desenvolvedores juniores,
em geral, realizam tarefas simples ou com baixo impacto, geralmente porque n&atilde;o tem um grande conhecimento do projeto de arquitetura, isso n&atilde;o significa
que eles n&atilde;o sabem utilizar uma ferramente t&eacute;cnica, e sim, o impacto que aquela pequena modifica&ccedil;&atilde;o, que um simples esquecimento em liberar
um &uacute;nico byte da mem&oacute;ria pode impactar no desempenho depois de milhoes de ciclos. Os desenvolvedores de n&iacute;vel m&eacute;dio muitas vezes j&aacute;
est&atilde;o preparados para este tipo de solu&ccedil;&otilde;es, mais muitas veses, eles focam apenas em realizar tarefas, j&aacute; dominam total e plenamente a linguagem
e ferramentas usadas em todo o ciclo do software, por&eacute;m, ainda esquecem do impacto de algumas a&ccedil;&otilde;es ou na preocupa&ccedil;&atilde;o com o todo, n&atilde;o
s&oacute; com seu trabalho.
</div><
<br>
<br>
<br>
<br>
<br>
<br>


  <center>

  
  <footer>
    <p class="main" color="black">
        2023 © TCC  |  | Desenvolvido por Kaike
    </p>
</footer></div></center>

    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    </body>